examples/square2D_VIV_multiprocessing/env05/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "10";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
36597
(
-1.3984555e-05
0.050668967
-1.634986e-05
0.050307564
-2.0246713e-05
0.049627238
-2.2233224e-05
0.048636616
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
134
(
-0.050662622
-0.050305198
-0.049623342
-0.048634629
-0.047363912
-0.045842014
-0.044104209
-0.042188577
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
134
(
0.051366704
0.051027377
0.050378904
0.049419053
0.048178945
0.046680306
0.04496184
0.043056674
...
)
;
    }
    syms
    {
        type            calculated;
        value           nonuniform List<scalar> 
294
(
7.6393802e-06
2.953984e-05
5.5098105e-05
8.2499282e-05
0.00011016702
0.00013653586
0.00016012207
0.00017976846
...
)
;
    }
    front1
    {
        type            calculated;
        value           uniform 0.00039753383;
    }
    front2
    {
        type            calculated;
        value           uniform -0.00039753383;
    }
    middle1
    {
        type            calculated;
        value           uniform 0.00039753365;
    }
    middle2
    {
        type            calculated;
        value           uniform -0.00039753365;
    }
    back1
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0.00039753327 0.00039753328);
    }
    back2
    {
        type            calculated;
        value           nonuniform List<scalar> 2(-0.00039753327 -0.00039753328);
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
