examples/square2D_VIV_multiprocessing/env05/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "10";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
37650
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    syms
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front1
    {
        type            calculated;
    }
    front2
    {
        type            calculated;
    }
    middle1
    {
        type            calculated;
    }
    middle2
    {
        type            calculated;
    }
    back1
    {
        type            calculated;
    }
    back2
    {
        type            calculated;
    }
    cylinder
    {
        type            calculated;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
