examples/square2D_VIV_multiprocessing/env05/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
18474
(
(0 0 -0.031246722)
(0 0 -0.053607704)
(0 0 -0.0592351)
(0 0 -0.071695992)
(0 0 -0.078159602)
(0 0 -0.08652971)
(0 0 -0.092151406)
(0 0 -0.097827009)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
134
(
(0 0 -0.027826148)
(0 0 -0.050138394)
(0 0 -0.055905245)
(0 0 -0.067064402)
(0 0 -0.073130234)
(0 0 -0.080421389)
(0 0 -0.085420708)
(0 0 -0.090223772)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
134
(
(0 0 -0.01842313)
(0 0 -0.053329012)
(0 0 -0.071901254)
(0 0 -0.082069686)
(0 0 -0.091582819)
(0 0 -0.098193371)
(0 0 -0.10432497)
(0 0 -0.1078381)
...
)
;
    }
    syms
    {
        type            calculated;
        value           nonuniform List<vector> 
294
(
(0 0 -0.032233145)
(0 0 -0.03907386)
(0 0 -0.045343171)
(0 0 -0.050554077)
(0 0 -0.054657838)
(0 0 -0.057378427)
(0 0 -0.0585586)
(0 0 -0.058349084)
...
)
;
    }
    front1
    {
        type            calculated;
        value           nonuniform List<vector> 2((-1.3340747e-22 5.1391434e-23 -2461.9725) (-4.822906e-23 2.1748638e-23 -1087.4962));
    }
    front2
    {
        type            calculated;
        value           nonuniform List<vector> 2((-3.5013577e-29 1.1857943e-23 1100.2634) (3.1621167e-23 -1.5542497e-23 640.90099));
    }
    middle1
    {
        type            calculated;
        value           nonuniform List<vector> 2((-1.5176889e-28 5.1399088e-23 -444.69053) (-3.9056585e-23 -1.3105398e-23 -143.68258));
    }
    middle2
    {
        type            calculated;
        value           nonuniform List<vector> 2((-2.1114871e-23 1.497949e-24 -152.56252) (-1.5032229e-29 -5.0909174e-24 145.09193));
    }
    back1
    {
        type            calculated;
        value           nonuniform List<vector> 2((-3.7593086e-23 6.2988223e-23 -751.83018) (-6.5988078e-23 -4.966373e-23 -533.49998));
    }
    back2
    {
        type            calculated;
        value           nonuniform List<vector> 2((2.5779519e-29 -8.7306637e-24 -271.23171) (-3.5422367e-23 -9.2345051e-24 38.280722));
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(-9.3649329e-23 -3.1027269e-23 1633.7516)
(1.798387e-24 0 1131.001)
(0 0 844.25323)
(0 0 681.83167)
(0 0 566.3011)
(0 0 479.02965)
(0 0 410.19076)
(0 0 353.84097)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
